// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
// let arr = [321,3,4,7,10];
// let arr2 = ['fkuk','okten','Juravlev','Bukreev','html'];
// let arr3 = [321,'fkuk',true,false,3.14];
// console.log(arr);
// console.log(arr2);
// console.log(arr3);

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//let a = [];
// a[0]='Bukreev';
// a[1]='Igor';
// a[2]=33;
// a[3]=true;
// a[4]=false;
// a[5]='12345';
// console.log(a);

// -- Створити пустий масив вторая версия.
// let arr = [];
// for (let i = 0; i <= 4; i++) {
//     arr[i] = i + 1;
// }
// console.log(arr);

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// for (let r=0; r<10; r++){
//     document.write(`<div> блок </div>`);
// }

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let r=0; r<10; r++){
//     document.write(`<div> блок  ${r}</div>`);
// }

// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// g=0;
// while (g < 20){
//     document.write(`<h1> блок </h1>`);
//     g++;
// }

